app/controllers/contracts_controller.rb

SELECT * FROM "contracts"
---
  def index
    @contracts = Contract.all