app/controllers/customers_controller.rb

SELECT * FROM "customers"
---
  def index
    @customers = Customer.all

SELECT * FROM "customers" WHERE ("customers"."id" = 1)
---
  def show
    @customer = Customer.find(params[:id])

SELECT * FROM "customers" WHERE ("customers"."id" = 1)
---
  def edit
    @customer = Customer.find(params[:id])

SELECT * FROM "customers" WHERE ("customers"."id" = 1)
UPDATE "customers" SET "phone" = '3130774580', "updated_at" = '2010-03-09 14:44:31', "rating" = '5', "description" = 'A pretty awesome company' WHERE "id" = 1
---
  def update
    @customer = Customer.find(params[:id])

    respond_to do |format|
      if @customer.update_attributes(params[:customer])