app/controllers/projects_controller.rb

SELECT * FROM "projects"
---
  def index
    @projects = Project.all(:include=>:customer)

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("name", "created_at", "updated_at", "description", "customer_id") VALUES('Our second project', '2010-03-09 14:44:54', '2010-03-09 14:44:54', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.', 1)
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
UPDATE "projects" SET "updated_at" = '2010-03-09 14:46:50', "customer_id" = 2, "description" = '' WHERE "id" = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT "customers".id FROM "customers" WHERE ("customers"."name" = 'Basic, Inc.' AND "customers".id <> 2) LIMIT 1
---
  def load_customers
    @customers = Customer.all.collect { |c| [c.name, c.id] }

SELECT * FROM "users" ORDER BY name
---
  def load_users
    @users = User.all(:order => "name")